app/controllers/users_controller.rb

INSERT INTO "users" ("firstname", "lastname", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstname", "asdasd"], ["lastname", "asd"], ["email", "asd"], ["password", "123"], ["created_at", "2017-10-09 09:57:38.701001"], ["updated_at", "2017-10-09 09:57:38.701001"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? AND "users"."password" = ? LIMIT ?  [["email", "asd"], ["password", "123"], ["LIMIT", 1]]
---
  def logresult
    pp params[:user][:email]
    pp params[:user][:password]
    @user = User.find_by_email_and_password(params[:user][:email],params[:user][:password])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @user = User.find(session[:user])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @user = User.find(session[:user])